#include<iostream>
using namespace std;
const int N = 10010;
const int M = 1000010;
char p[N], s[M];   //p[]代表模式串，s[]代表文本串
int ne[N];         // ne[i] 表示 p[1 ~ i] 中最长相等前后缀的长度 即p[1 ~ j] == p[i - j + 1 ~ i]  核心：前缀与后缀相等，且ne[i]能够定位到前缀的末尾
int main()
{
	int n, m;
	scanf("%d%s%d%s", &n, p + 1, &m, s + 1); //从下标1开始存储字符串
	//计算ne[]数组
	for (int i = 2, j = 0; i <= n; i++) {
		while (j && p[i] != p[j + 1]) {       //如果当前的p[i]与p[j + 1]不匹配，那么把前面已经匹配的一段的前缀末尾移动到j处，看之后的是否匹配
			j = ne[j];
		}
		if (p[i] == p[j + 1]) {               //如果当前的p[i]与p[j + 1]匹配，那么把最长的"相等前缀后缀"加1
			j++;
		}
		ne[i] = j;                            //把最长的“相等前缀后缀”赋值给ne[i]
	}

	//kmp匹配
	for (int i = 1,j = 0; i <= m; i++) {
		while (j && s[i] != p[j + 1]) {
			j = ne[j];                       //如果当前的s[i]与p[j + 1]不匹配，那么把前面已经匹配过的一段的前缀末尾移动到j处，看之后是否匹配
		}
		if (s[i] == p[j + 1]) {
			j++;                             //如果匹配，那么匹配的长度j加1
		}
		if (j == n) {
			cout << i - n << ' ';             //文本串的字串完全与模板串匹配，输出与之匹配的文本串的起始下标
			j = ne[j];                        //把已经匹配的一段的前缀末尾移动到j处，看之后是否匹配
		}
	}
}